GopalSaraf/Practicals/PSDL/include/proc/pic16f1823.inc
// Register: PORTC
#define PORTC PORTC
PORTC                                    equ 000Eh
// bitfield definitions
PORTC_RC0_POSN                           equ 0000h
PORTC_RC0_POSITION                       equ 0000h
PORTC_RC0_SIZE                           equ 0001h
PORTC_RC0_LENGTH                         equ 0001h
PORTC_RC0_MASK                           equ 0001h
PORTC_RC1_POSN                           equ 0001h
PORTC_RC1_POSITION                       equ 0001h
PORTC_RC1_SIZE                           equ 0001h
PORTC_RC1_LENGTH                         equ 0001h
PORTC_RC1_MASK                           equ 0002h
PORTC_RC2_POSN                           equ 0002h
PORTC_RC2_POSITION                       equ 0002h
PORTC_RC2_SIZE                           equ 0001h
PORTC_RC2_LENGTH                         equ 0001h
PORTC_RC2_MASK                           equ 0004h
PORTC_RC3_POSN                           equ 0003h
PORTC_RC3_POSITION                       equ 0003h
PORTC_RC3_SIZE                           equ 0001h
PORTC_RC3_LENGTH                         equ 0001h
PORTC_RC3_MASK                           equ 0008h
PORTC_RC4_POSN                           equ 0004h
PORTC_RC4_POSITION                       equ 0004h
PORTC_RC4_SIZE                           equ 0001h
PORTC_RC4_LENGTH                         equ 0001h
PORTC_RC4_MASK                           equ 0010h
PORTC_RC5_POSN                           equ 0005h
PORTC_RC5_POSITION                       equ 0005h
PORTC_RC5_SIZE                           equ 0001h
PORTC_RC5_LENGTH                         equ 0001h
PORTC_RC5_MASK                           equ 0020h
PORTC_AN4_POSN                           equ 0000h
PORTC_AN4_POSITION                       equ 0000h
PORTC_AN4_SIZE                           equ 0001h
PORTC_AN4_LENGTH                         equ 0001h
PORTC_AN4_MASK                           equ 0001h
PORTC_AN5_POSN                           equ 0001h
PORTC_AN5_POSITION                       equ 0001h
PORTC_AN5_SIZE                           equ 0001h
PORTC_AN5_LENGTH                         equ 0001h
PORTC_AN5_MASK                           equ 0002h
PORTC_AN6_POSN                           equ 0002h
PORTC_AN6_POSITION                       equ 0002h
PORTC_AN6_SIZE                           equ 0001h
PORTC_AN6_LENGTH                         equ 0001h
PORTC_AN6_MASK                           equ 0004h
PORTC_AN7_POSN                           equ 0003h
PORTC_AN7_POSITION                       equ 0003h
PORTC_AN7_SIZE                           equ 0001h
PORTC_AN7_LENGTH                         equ 0001h
PORTC_AN7_MASK                           equ 0008h
PORTC_CPS4_POSN                          equ 0000h
PORTC_CPS4_POSITION                      equ 0000h
PORTC_CPS4_SIZE                          equ 0001h
PORTC_CPS4_LENGTH                        equ 0001h
PORTC_CPS4_MASK                          equ 0001h
PORTC_CPS5_POSN                          equ 0001h
PORTC_CPS5_POSITION                      equ 0001h
PORTC_CPS5_SIZE                          equ 0001h
PORTC_CPS5_LENGTH                        equ 0001h
PORTC_CPS5_MASK                          equ 0002h
PORTC_CPS6_POSN                          equ 0002h
PORTC_CPS6_POSITION                      equ 0002h
PORTC_CPS6_SIZE                          equ 0001h
PORTC_CPS6_LENGTH                        equ 0001h
PORTC_CPS6_MASK                          equ 0004h
PORTC_CPS7_POSN                          equ 0003h
PORTC_CPS7_POSITION                      equ 0003h
PORTC_CPS7_SIZE                          equ 0001h
PORTC_CPS7_LENGTH                        equ 0001h
PORTC_CPS7_MASK                          equ 0008h
PORTC_C2INP_POSN                         equ 0000h
PORTC_C2INP_POSITION                     equ 0000h
PORTC_C2INP_SIZE                         equ 0001h
PORTC_C2INP_LENGTH                       equ 0001h
PORTC_C2INP_MASK                         equ 0001h
PORTC_C12IN1N_POSN                       equ 0001h
PORTC_C12IN1N_POSITION                   equ 0001h
PORTC_C12IN1N_SIZE                       equ 0001h
PORTC_C12IN1N_LENGTH                     equ 0001h
PORTC_C12IN1N_MASK                       equ 0002h
PORTC_C12IN2N_POSN                       equ 0002h
PORTC_C12IN2N_POSITION                   equ 0002h
PORTC_C12IN2N_SIZE                       equ 0001h
PORTC_C12IN2N_LENGTH                     equ 0001h
PORTC_C12IN2N_MASK                       equ 0004h
PORTC_C12IN3N_POSN                       equ 0003h
PORTC_C12IN3N_POSITION                   equ 0003h
PORTC_C12IN3N_SIZE                       equ 0001h
PORTC_C12IN3N_LENGTH                     equ 0001h
PORTC_C12IN3N_MASK                       equ 0008h
PORTC_C2OUT_POSN                         equ 0004h
PORTC_C2OUT_POSITION                     equ 0004h
PORTC_C2OUT_SIZE                         equ 0001h
PORTC_C2OUT_LENGTH                       equ 0001h
PORTC_C2OUT_MASK                         equ 0010h
PORTC_SCL_POSN                           equ 0000h
PORTC_SCL_POSITION                       equ 0000h
PORTC_SCL_SIZE                           equ 0001h
PORTC_SCL_LENGTH                         equ 0001h
PORTC_SCL_MASK                           equ 0001h
PORTC_SDA_POSN                           equ 0001h
PORTC_SDA_POSITION                       equ 0001h
PORTC_SDA_SIZE                           equ 0001h
PORTC_SDA_LENGTH                         equ 0001h
PORTC_SDA_MASK                           equ 0002h
PORTC_P1D_POSN                           equ 0002h
PORTC_P1D_POSITION                       equ 0002h
PORTC_P1D_SIZE                           equ 0001h
PORTC_P1D_LENGTH                         equ 0001h
PORTC_P1D_MASK                           equ 0004h
PORTC_P1C_POSN                           equ 0003h
PORTC_P1C_POSITION                       equ 0003h
PORTC_P1C_SIZE                           equ 0001h
PORTC_P1C_LENGTH                         equ 0001h
PORTC_P1C_MASK                           equ 0008h
PORTC_P1B_POSN                           equ 0004h
PORTC_P1B_POSITION                       equ 0004h
PORTC_P1B_SIZE                           equ 0001h
PORTC_P1B_LENGTH                         equ 0001h
PORTC_P1B_MASK                           equ 0010h
PORTC_P1A_POSN                           equ 0005h
PORTC_P1A_POSITION                       equ 0005h
PORTC_P1A_SIZE                           equ 0001h
PORTC_P1A_LENGTH                         equ 0001h
PORTC_P1A_MASK                           equ 0020h
PORTC_SCK_POSN                           equ 0000h
PORTC_SCK_POSITION                       equ 0000h
PORTC_SCK_SIZE                           equ 0001h
PORTC_SCK_LENGTH                         equ 0001h
PORTC_SCK_MASK                           equ 0001h
PORTC_SDI_POSN                           equ 0001h
PORTC_SDI_POSITION                       equ 0001h
PORTC_SDI_SIZE                           equ 0001h
PORTC_SDI_LENGTH                         equ 0001h
PORTC_SDI_MASK                           equ 0002h
PORTC_SDO_POSN                           equ 0002h
PORTC_SDO_POSITION                       equ 0002h
PORTC_SDO_SIZE                           equ 0001h
PORTC_SDO_LENGTH                         equ 0001h
PORTC_SDO_MASK                           equ 0004h
PORTC_nSS_POSN                           equ 0003h
PORTC_nSS_POSITION                       equ 0003h
PORTC_nSS_SIZE                           equ 0001h
PORTC_nSS_LENGTH                         equ 0001h
PORTC_nSS_MASK                           equ 0008h
PORTC_SRNQ_POSN                          equ 0004h
PORTC_SRNQ_POSITION                      equ 0004h
PORTC_SRNQ_SIZE                          equ 0001h
PORTC_SRNQ_LENGTH                        equ 0001h
PORTC_SRNQ_MASK                          equ 0010h
PORTC_CCP1_POSN                          equ 0005h
PORTC_CCP1_POSITION                      equ 0005h
PORTC_CCP1_SIZE                          equ 0001h
PORTC_CCP1_LENGTH                        equ 0001h
PORTC_CCP1_MASK                          equ 0020h
PORTC_MDCIN1_POSN                        equ 0002h
PORTC_MDCIN1_POSITION                    equ 0002h
PORTC_MDCIN1_SIZE                        equ 0001h
PORTC_MDCIN1_LENGTH                      equ 0001h
PORTC_MDCIN1_MASK                        equ 0004h
PORTC_MDMIN_POSN                         equ 0003h
PORTC_MDMIN_POSITION                     equ 0003h
PORTC_MDMIN_SIZE                         equ 0001h
PORTC_MDMIN_LENGTH                       equ 0001h
PORTC_MDMIN_MASK                         equ 0008h
PORTC_MDOUT_POSN                         equ 0004h
PORTC_MDOUT_POSITION                     equ 0004h
PORTC_MDOUT_SIZE                         equ 0001h
PORTC_MDOUT_LENGTH                       equ 0001h
PORTC_MDOUT_MASK                         equ 0010h
PORTC_MDCIN2_POSN                        equ 0005h
PORTC_MDCIN2_POSITION                    equ 0005h
PORTC_MDCIN2_SIZE                        equ 0001h
PORTC_MDCIN2_LENGTH                      equ 0001h
PORTC_MDCIN2_MASK                        equ 0020h
PORTC_TX_POSN                            equ 0004h
PORTC_TX_POSITION                        equ 0004h
PORTC_TX_SIZE                            equ 0001h
PORTC_TX_LENGTH                          equ 0001h
PORTC_TX_MASK                            equ 0010h
PORTC_RX_POSN                            equ 0005h
PORTC_RX_POSITION                        equ 0005h
PORTC_RX_SIZE                            equ 0001h
PORTC_RX_LENGTH                          equ 0001h
PORTC_RX_MASK                            equ 0020h
PORTC_CK_POSN                            equ 0004h
PORTC_CK_POSITION                        equ 0004h
PORTC_CK_SIZE                            equ 0001h
PORTC_CK_LENGTH                          equ 0001h
PORTC_CK_MASK                            equ 0010h
PORTC_DT_POSN                            equ 0005h
PORTC_DT_POSITION                        equ 0005h
PORTC_DT_SIZE                            equ 0001h
PORTC_DT_LENGTH                          equ 0001h
PORTC_DT_MASK                            equ 0020h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 0011h
// bitfield definitions
PIR1_TMR1IF_POSN                         equ 0000h
PIR1_TMR1IF_POSITION                     equ 0000h
PIR1_TMR1IF_SIZE                         equ 0001h
PIR1_TMR1IF_LENGTH                       equ 0001h
PIR1_TMR1IF_MASK                         equ 0001h
PIR1_TMR2IF_POSN                         equ 0001h
PIR1_TMR2IF_POSITION                     equ 0001h
PIR1_TMR2IF_SIZE                         equ 0001h
PIR1_TMR2IF_LENGTH                       equ 0001h
PIR1_TMR2IF_MASK                         equ 0002h
PIR1_CCP1IF_POSN                         equ 0002h
PIR1_CCP1IF_POSITION                     equ 0002h
PIR1_CCP1IF_SIZE                         equ 0001h
PIR1_CCP1IF_LENGTH                       equ 0001h
PIR1_CCP1IF_MASK                         equ 0004h
PIR1_SSP1IF_POSN                         equ 0003h
PIR1_SSP1IF_POSITION                     equ 0003h
PIR1_SSP1IF_SIZE                         equ 0001h
PIR1_SSP1IF_LENGTH                       equ 0001h
PIR1_SSP1IF_MASK                         equ 0008h
PIR1_TXIF_POSN                           equ 0004h
PIR1_TXIF_POSITION                       equ 0004h
PIR1_TXIF_SIZE                           equ 0001h
PIR1_TXIF_LENGTH                         equ 0001h
PIR1_TXIF_MASK                           equ 0010h
PIR1_RCIF_POSN                           equ 0005h
PIR1_RCIF_POSITION                       equ 0005h
PIR1_RCIF_SIZE                           equ 0001h
PIR1_RCIF_LENGTH                         equ 0001h
PIR1_RCIF_MASK                           equ 0020h
PIR1_ADIF_POSN                           equ 0006h
PIR1_ADIF_POSITION                       equ 0006h
PIR1_ADIF_SIZE                           equ 0001h
PIR1_ADIF_LENGTH                         equ 0001h
PIR1_ADIF_MASK                           equ 0040h
PIR1_TMR1GIF_POSN                        equ 0007h
PIR1_TMR1GIF_POSITION                    equ 0007h
PIR1_TMR1GIF_SIZE                        equ 0001h
PIR1_TMR1GIF_LENGTH                      equ 0001h
PIR1_TMR1GIF_MASK                        equ 0080h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 0012h
// bitfield definitions
PIR2_BCL1IF_POSN                         equ 0003h
PIR2_BCL1IF_POSITION                     equ 0003h
PIR2_BCL1IF_SIZE                         equ 0001h
PIR2_BCL1IF_LENGTH                       equ 0001h
PIR2_BCL1IF_MASK                         equ 0008h
PIR2_EEIF_POSN                           equ 0004h
PIR2_EEIF_POSITION                       equ 0004h
PIR2_EEIF_SIZE                           equ 0001h
PIR2_EEIF_LENGTH                         equ 0001h
PIR2_EEIF_MASK                           equ 0010h
PIR2_C1IF_POSN                           equ 0005h
PIR2_C1IF_POSITION                       equ 0005h
PIR2_C1IF_SIZE                           equ 0001h
PIR2_C1IF_LENGTH                         equ 0001h
PIR2_C1IF_MASK                           equ 0020h
PIR2_C2IF_POSN                           equ 0006h
PIR2_C2IF_POSITION                       equ 0006h
PIR2_C2IF_SIZE                           equ 0001h
PIR2_C2IF_LENGTH                         equ 0001h
PIR2_C2IF_MASK                           equ 0040h
PIR2_OSFIF_POSN                          equ 0007h
PIR2_OSFIF_POSITION                      equ 0007h
PIR2_OSFIF_SIZE                          equ 0001h
PIR2_OSFIF_LENGTH                        equ 0001h
PIR2_OSFIF_MASK                          equ 0080h

